modm-ext/data.modm.io/docs/svd/header_stm32wb07.svd
        <register>
          <name>PRESC</name>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRESCALER</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Input clock not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Input clock divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Input clock divided by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Input clock divided by 8</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV10</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Input clock divided by 32</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC1</name>
      <groupName>ADC</groupName>
      <baseAddress>0x41006000</baseAddress>
      <interrupt>
        <name>ADC</name>
        <description>12 ADC interrupt</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>VERSION_ID</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VERSION_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEQUENCE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEQ_LEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SMPS_SYNCHRO_ENA</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OP_MODE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUDIO</name>
                  <description>ADC operation mode AUDIO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC operation mode ADC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>ADC operation Full mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE_RATE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DMA_DS_ENA</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_DF_ENA</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_DS_CFG</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOST</name>
                  <description>Previous data is preserved, new data is lost.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEPT</name>
                  <description>Previous data is overwritten, new data is kept.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVR_DF_CFG</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT_INVERT_SN</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT_INVERT_DIFF</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC_CONT_1V2</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBIAS_PRECH_FORCE</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADC_ON_OFF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START_CONV</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOP_OP_MODE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIG_AUD_MODE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC_LDO_ENA</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OCM_CTRL</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCM_SRC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBAT</name>
                  <description>ADC occasional mode source VBAT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMP</name>
                  <description>ADC occasional mode source temperature sensor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCM_ENA</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PGA_CONF</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PGA_GAIN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAIN_06_DB</name>
                  <description>Set the microphone gain at 6 dB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_09_DB</name>
                  <description>Set the microphone gain at 9 dB</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_12_DB</name>
                  <description>Set the microphone gain at 12 dB</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_15_DB</name>
                  <description>Set the microphone gain at 15 dB</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_18_DB</name>
                  <description>Set the microphone gain at 18 dB</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_21_DB</name>
                  <description>Set the microphone gain at 21 dB</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_24_DB</name>
                  <description>Set the microphone gain at 24 dB</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_27_DB</name>
                  <description>Set the microphone gain at 27 dB</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_30_DB</name>
                  <description>Set the microphone gain at 30 dB</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGA_BIAS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIAS_050_BAT</name>
                  <description>Set the microphone bias voltage at 0.50 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_055_BAT</name>
                  <description>Set the microphone bias voltage at 0.55 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_060_BAT</name>
                  <description>Set the microphone bias voltage at 0.60 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_065_BAT</name>
                  <description>Set the microphone bias voltage at 0.65 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_070_BAT</name>
                  <description>Set the microphone bias voltage at 0.70 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_075_BAT</name>
                  <description>Set the microphone bias voltage at 0.75 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_080_BAT</name>
                  <description>Set the microphone bias voltage at 0.80 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_090_BAT</name>
                  <description>Set the microphone bias voltage at 0.90 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWITCH</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SE_VIN_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_1</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_2</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_3</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_4</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_5</name>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_6</name>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_7</name>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DF_CONF</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DF_CIC_DEC_FACTOR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIG_47619_HZ</name>
                  <description>ADC digital microphone output frequency 47.619 kHz</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_44440_HZ</name>
                  <description>ADC digital microphone output frequency 44.44 kHz</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_22220_HZ</name>
                  <description>ADC digital microphone output frequency 22.22 kHz</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_15873_HZ</name>
                  <description>ADC digital microphone output frequency 15.873 kHz</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_7936_HZ</name>
                  <description>ADC digital microphone output frequency 7.936 kHz</description>
                  <value>84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANA_200000_HZ</name>
                  <description>ADC analog microphone output frequency 200.00 kHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANA_15873_HZ</name>
                  <description>ADC analog microphone output frequency 15.873 kHz</description>
                  <value>21</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DF_CIC_DHF</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALF</name>
                  <description>ADC CIC decimator factor half</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTEGER</name>
                  <description>ADC CIC decimator factor integer</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DF_ITP1P2</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DF_I_U2S</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DF_O_S2U</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDM_RATE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <description>ADC PDM clock divider 10</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_11</name>
                  <description>ADC PDM clock divider 11</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <description>ADC PDM clock divider 12</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_13</name>
                  <description>ADC PDM clock divider 13</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <description>ADC PDM clock divider 14</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_15</name>
                  <description>ADC PDM clock divider 15</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>ADC PDM clock divider 16</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_17</name>
                  <description>ADC PDM clock divider 17</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_18</name>
                  <description>ADC PDM clock divider 18</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_19</name>
                  <description>ADC PDM clock divider 19</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_20</name>
                  <description>ADC PDM clock divider 20</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_21</name>
                  <description>ADC PDM clock divider 21</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_22</name>
                  <description>ADC PDM clock divider 22</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_23</name>
                  <description>ADC PDM clock divider 23</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_24</name>
                  <description>ADC PDM clock divider 24</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_25</name>
                  <description>ADC PDM clock divider 25</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DF_MICROL_RN</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEFT</name>
                  <description>ADC microphone channel left</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT</name>
                  <description>ADC microphone channel right</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DF_HPF_EN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DF_HALF_D_EN</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
